Repository: Feder1co5oave/reti2012
Catalog: locale/*.po
Languages: it

source: %s is %s
it: %s è %s

source: %s is now %s
it: %s è diventato %s

source: ======== Closing logfile at %s
it: ======== Chiusura file di log il %s

source: ======== Opening logfile at %s
it: ======== Apertura file di log il %s

source: Accept (y) or refuse (n) ?
it: Accetta (s) o rifiuta (n) ?

source: Bound opp_socket to %s:%hu
it: opp_socket associato su %s:%hu

source: Cannot connect to client, go back to FREE
it: Impossibile connettersi al client

source: Cannot de-connect opp_socket
it: Impossibile fare il de-connect del socket di gioco

source: Cannot set gettext domain
it: Impossibile impostare il dominio gettext

source: Cannot set locale
it: Impossibile impostare la localizzazione

source: Cannot set message catalogs directory
it: Impossibile impostare il percorso dei cataloghi

source: Client %s has username [%s]
it: Il client %s ha username [%s]

source: Client %s tried to login with an invalid username
it: Il client %s ha tentato di loggarsi con uno username non valido

source: Client %s tried to login with existing username=%s
it: Il client %s ha tentato di loggarsi con uno username già esistente=%s

source: Client %s tried to login with invalid username
it: Il client %s ha tentato di loggarsi con uno username non valido

source: Client has invalid address
it: Indirizzo host non valido

source: Closing %d client connections...
it: Chiudo %d connessioni client...

source: Commands: end, exit, help, hit, show, who
it: Comandi: end, exit, help, hit, show, who

source: Commands: exit, help, play, who
it: Comandi: exit, help, play, who

source: Commands: help, who, playing, exit
it: Comandi: help, who, playing, exit

source: Connected opp_socket to %s:%hu
it: opp_socket connesso a %s:%hu

source: Connected to the server
it: Connessione al server avvenuta con successo

source: Draw!
it: Parità!

source: End of match. You are now free.
it: Fine della partita

source: Error accept()
it: Errore accept()

source: Error bind()
it: Errore bind()

source: Error bind(SOCK_DGRAM)
it: Errore bind(SOCK_DGRAM)

source: Error connect()
it: Errore connect()

source: Error connect(SOCK_DGRAM)
it: Errore connect(SOCK_DGRAM)

source: Error fopen()
it: Errore fopen()

source: Error getsockname()
it: Errore getsockname()

source: Error listen()
it: Errore listen()

source: Error malloc()
it: Errore malloc()

source: Error poll()
it: Errore poll()

source: Error recv()
it: Errore recv()

source: Error select()
it: Errore select()

source: Error send()
it: Errore send()

source: Error setsockopt()
it: Errore setsockopt()

source: Error sigaction()
it: Errore sigaction()

source: Error socket()
it: Errore socket()

source: Error socket(SOCK_DGRAM)
it: Errore socket(SOCK_DGRAM)

source: Exiting...
it: Chiusura in corso...

source: Finished sending %d bytes of data to %s
it: Ho completato l'invio di %d byte di dati a %s

source: Gettext domain set to '%s'
it: Dominio gettext impostato su '%s'

source: Going to say hello...
it: Sto per contattare l'altro client (hello)...

source: Got %d bytes in inactive from %s
it: Ricevuti %d bytes in inactive da %s

source: Got %s from %s:%hu
it: Ricevuto %s da %s:%hu

source: Got %s from player
it: Ricevuto %s dal giocatore

source: Got %s in get_play_resp from %s
it: Ricevuto %s in get_play_resp da %s

source: Got %s in inactive from %s
it: Ricevuto %s in inactive da %s

source: Got BADREQ on line %d, cmd=%s from %s
it: Ricevuto BADREQ alla linea %d, cmd=%s, da %s

source: Got REQ_LOGIN from %s
it: Ricevuto REQ_LOGIN da %s

source: Got REQ_PLAY from server while %s
it: Ricevuto REQ_PLAY dal server mentre %s

source: Got cmd=%s from %s in cancel_request
it: Ricevuto cmd=%s da %s in cancel_request

source: Got cmd=%s from %s in idle_free
it: Ricevuto cmd=%s da %s in idle_free

source: Got cmd=%s from %s in idle_play
it: Ricevuto cmd=%s da %s in idle_play

source: Got delayed play response=%s
it: Ricevuta in ritardo la risposta=%s a una richiesta di gioco

source: Got play request from [%s]. Accept (y) or refuse (n) ?
it: Ricevuta richiesta di gioco da [%s]. Accetta (s) o rifiuta (n) ?

source: Got unwanted user input while %s:
it: Ricevuto input indesiderato mentre %s

source: Hash is %08x
it: L'hash è %08x

source: Hash mismatch
it: Errore: hash errato! La mappa di gioco è corrotta.

source: Hitting on cell %d...
it: Sto per colpire la cella %d...

source: I am host %s:%hu
it: Sono l'host %s:%hu

source: I am now %s
it: Ora sono %s

source: Incoming connection from %s
it: Connessione in arrivo da %s

source: Insert your UDP port:
it: Inserisci la porta UDP di ascolto:

source: Insert your username:
it: Inserisci lo username:

source: Invalid host address
it: Indirizzo host non valido

source: Invalid server address
it: Indirizzo server non valido

source: It is %s's turn
it: E' il turno di %s

source: It is not your turn
it: Non è il tuo turno

source: It is your turn.
it: E' il tuo turno

source: It's your turn
it: E' il tuo turno

source: Locale set to '%s'
it: Localizzazione impostata su '%s'

source: Lost connection to server
it: Connessione al server interrotta

source: Match has started. It is %s's turn
it: La partita è iniziata. E' il turno di %s

source: Match has started. It's your turn
it: La partita è iniziata. E' il tuo turno

source: Message catalogs directory set to '%s'
it: Percorso dei cataloghi impostato su '%s'

source: No one is playing
it: Nessuno sta giocando

source: Opened opp_socket
it: opp_socket aperto

source: Preparing to send %s to %s
it: Mi preparo a inviare %s a %s

source: Preparing to send REQ_PLAY data to [%s]
it: Mi preparo a inviare dati REQ_PLAY a [%s]

source: Preparing to send RESP_OK_PLAY data to [%s]
it: Mi preparo a inviare dati RESP_OK_PLAY a [%s]

source: Preparing to send RESP_WHO data to [%s]
it: Mi preparo a inviare dati RESP_WHO a [%s]

source: Received SIGABRT
it: Ricevuto SIGABRT

source: Received SIGINT
it: Ricevuto SIGINT

source: Received SIGTERM
it: Ricevuto SIGTERM

source: Received signal %d
it: Ricevuto il segnale %d

source: Received=%d on line %d
it: Ricevuti=%d alla linea %d

source: Received=%d on line %d from %s
it: Ricevuti=%d alla linea %d da %s

source: Request accepted. Waiting for connection from the other client...
it: Richiesta accettata, in attesa di connessione dall'altro client...

source: Request automatically refused due to an error
it: Richiesta automaticamente rifiutata a causa di un errore

source: Request refused
it: Richiesta rifiutata

source: Salt is %08x
it: Il salt per questa partita è %08x

source: Select() timed out while %s
it: Timeout per select() mentre %s

source: Sent play request to [%s], waiting for response...
it: Richiesta di gioco inviata a [%s], in attesa di risposta...

source: Server listening on %s:%hu
it: Server in ascolto sulla porta %s:%hu

source: Successfully logged in as [%s]
it: Loggato con successo come [%s]

source: Syntax: hit <n>, where n is 1-9
it: Sintassi: hit <n>, dove n è 1-9

source: Syntax: play <player>
it: Sintassi: play <giocatore>

source: That cell is already taken
it: Quella cella è già occupata

source: There are %u connected clients:
it: Ci sono %u client connessi:

source: There are no connected clients.
it: Non ci sono client connessi.

source: This UDP port is already in use, choose another one
it: Questa porta UDP è già in uso, scegline un'altra

source: This username is badly formatted
it: Questo username è malformato

source: This username is taken
it: Questo username è già in uso

source: This username is too long
it: Questo username è troppo lungo

source: This username is too short
it: Questo username è troppo corto

source: Time out: leaving game...
it: Timeout: termino la partita...

source: Timeout while waiting for connection from the other client
it: Timeout mentre si era in attesa di connessione dall'altro client

source: Timeout while waiting for play response
it: Timeout mentre si era in attesa di risposta dall'altro client

source: UDP port is %hu
it: La porta UDP di ascolto è %hu

source: Unexpected event on line %d
it: Evento inatteso alla linea %d

source: Unexpected event on line %d while %s
it: Evento inatteso alla linea %d mentre %s

source: Unexpected event on line %d, both clients are NULL
it: Evento inatteso alla linea %d, entrambi i client sono NULL

source: Unexpected event on line %d, got read event on socket descriptor %d
it: Evento inatteso alla linea %d, ricevuti dati sul descrittore socket %d

source: Unexpected event on line %d, got write event on socket descriptor %d
it: Evento inatteso alla linea %d, buffer di uscita vuoto sul descrittore socket %d

source: Unexpected event on line %d: byte=%s
it: Evento inatteso alla linea %d, byte=%s

source: Unexpected request from %s in idle_free
it: Richiesta inattesa da %s in idle_free

source: Unexpected request from %s in idle_play
it: Richiesta inattesa da %s in idle_play

source: Unexpected server cmd: %s
it: Comando dal server inatteso: %s

source: Unexpected server response: %s
it: Risposta dal server inattesa: %s

source: Unknown command. Type 'help' for list of commands
it: Comando sconosciuto. Digita 'help' per una lista di comandi

source: Usage: %s <host> <listening_port>
it: Utilizzo: %s <ip_server> <porta_ascolto>

source: Usage: %s <server_ip> <server_port>
it: Utilizzo: %s <ip_server> <porta_server>

source: You cannot play with yourself
it: Non puoi giocare con te stesso

source: You hit on cell %d
it: Colpito sulla cella %d

source: You lost!
it: Hai perso!

source: You surrendered!
it: Ti sei arreso!

source: You won!
it: Hai vinto!

source: Your UDP port is in the system range, it might not work
it: La porta UDP specificata è nel range delle porte di sistema, potrebbe provocare malfunzionamenti

source: Your UDP port is not in port range
it: La porta UDP specificata non è valida

source: Your opponent surrendered: you win!
it: L'avversario si è arreso: hai vinto!

source: [%s] <-- It's you!
it: [%s] <-- Sei tu!

source: [%s] Host %s listening on %hu
it: [%s] Client %s in ascolto sulla porta %hu

source: [%s] Listening on %s:%hu (udp)
it: [%s] In ascolto su %s:%hu (udp)

source: [%s] accepted to play
it: [%s] ha accettato di giocare

source: [%s] accepted to play with [%s]
it: [%s] ha accettato di giocare con [%s]

source: [%s] accepted to play with you. Contacting host %s:%hu...
it: [%s] ha accettato di giocare con te. Connessione in corso all'host %s:%hu...

source: [%s] cancelled playing with [%s]
it: [%s] ha annullato la richiesta di gioco con [%s]

source: [%s] disconnected
it: [%s] si è disconnesso

source: [%s] does not exist
it: [%s] non esiste

source: [%s] had a play request
it: [%s] aveva una richiesta di gioco

source: [%s] had a play request from [%s]
it: [%s] aveva una richiesta di gioco da parte di [%s]

source: [%s] had requested to play with [%s]
it: [%s] aveva richiesto di giocare con [%s]

source: [%s] hit on cell %d
it: [%s] ha colpito sulla cella %d

source: [%s] is occupied in another match
it: [%s] è occupato in un'altra partita

source: [%s] is playing
it: [%s] sta giocando

source: [%s] is playing with [%s]
it: [%s] sta giocando con [%s]

source: [%s] refused to play
it: [%s] ha rifiutato di giocare

source: [%s] refused to play with [%s]
it: [%s] ha rifiutato di giocare con [%s]

source: [%s] requested the list of connected clients
it: [%s] ha richiesto la lista dei client connessi

source: [%s] requested to play with [%s]
it: [%s] ha richiesto di giocare con [%s]

source: [%s] requested to play with himself
it: [%s] ha richiesto di giocare con sé stesso

source: [%s] requested to play with non-FREE player %s
it: [%s] ha richiesto di giocare con il giocatore non FREE %s

source: [%s] requested to play with nonexistent player
it: [%s] ha richiesto di giocare con un giocatore inesistente

source: [%s] requested to play with nonexistent player (too long)
it: [%s] ha richiesto di giocare con un giocatore inesistente (username troppo lungo)

source: [%s] stopped playing
it: [%s] ha smesso di giocare

source: [%s] stopped playing with [%s]
it: [%s] ha smesso di giocare con [%s]

source: [%s] was playing with [%s]
it: [%s] stava giocando con [%s]

source: [%s] was playing with [[unknown]]
it: [%s] stava giocando con [[sconosciuto]]

source: [[unknown]] %s disconnected
it: [[sconosciuto]] %s si è disconnesso

source: [[unknown]] Host %s, not logged in
it: [[sconosciuto]] Host %s, non loggato

source: y
it: s
